

#1.რა არის HTML: ვებ-გვერდის სტრუქტურისა და „ჩონჩხის“ შემქმნელი მარკირების ენა (ტექსტები, სურათები, ლინკები).
#2.Empty vs Container: Container-ს აქვს გახსნადი და დამხურავი თეგი და შიგნით შიგთავსი შეაქვს; Empty ცარიელია, დამხურავი არ სჭირდება და ფუნქციას თავისთავად ასრულებს.
#3.Frontend vs Backend:Frontend არის ვებ-გვერდის ხილული, ვიზუალური მხარე (რასაც მომხმარებელი ხედავს), ხოლო Backend — კულისებს მიღმა არსებული სერვერი და მონაცემთა ბაზები.
#4.ჩამოწერეთ ყველა ნასწავლი tag და მიუწერეთ განმარტება (სად და რატომ გამოიყენება)
#<html> — მთავარი თეგი, რომელიც აერთიანებს მთელ HTML დოკუმენტს და ბრაუზერს ეუბნება, რომ ეს არის ვებ-გვერდი.
#<head> — ტექნიკური ნაწილი; ინახავს ინფორმაციას გვერდის შესახებ (მაგ. კოდირებას, სათაურს), რომელიც პირდაპირ ეკრანზე არ ჩანს.
#<title> — მიუთითებს ვებ-გვერდის სათაურს, რომელიც ჩანს ბრაუზერის თაბზე (Tab).
#<h1> <h6> — სათაურების თეგები; გამოიყენება ტექსტში სათაურებისა და ქვესათაურების გამოსაყოფად (h1 არის ყველაზე დიდი და მთავარი სათაური, ხოლო h6 — ყველაზე პატარა).